#+title: notes on Tour

* ch 1

* ch 3

* EVAL notation

#+begin_src lisp
  nil
#+end_src

** exercises

#+begin_src lisp
  (equal 3 4)
#+end_src

#+RESULTS:
: NIL

** defining fuctions in EVAL notation

#+begin_src lisp
  (defun avg (x y)
    (/ (+ x y) 2.0)
    )
  (avg 3 5)
#+end_src

#+RESULTS:
: 4.0

** evaluating symbols

#+begin_src lisp
  pi
#+end_src

#+RESULTS:
: 3.1415926535897932385L0
